A = [30, 40, 5, 20]

# 以下請填入你的程式，並算出結果並且指定給 m ，下方的 print(m) 才能正常運行
i = 0
if(A[0] >= A[1]):
    i += 1
if(A[0] >= A[2]):
    i += 1
if(A[0] >= A[3]):
    i += 1
if(i != 2):
    i = 0
    if(A[1] >= A[0]):
        i += 1
    if(A[1] >= A[2]):
        i += 1
    if(A[1] >= A[3]):
        i += 1
    if(i != 2):
        i = 0
        if(A[2] >= A[0]):
            i += 1
        if(A[2] >= A[1]):
            i += 1
        if(A[2] >= A[3]):
            i += 1
        if(i != 2):
            m = A[3]
        else:
            m = A[2]
    else:
        m = A[1]
else:
    m = A[0]


# 以上請填入你的程式，並算出結果並且指定給 m ，下方的 print(m) 才能正常運行

print(m)
